class Song {
  String name;
  String details;
  String albumname;

  Song(this.name, this.details, this.albumname);
}

String song1 =
    "పల్లవి : ఆరాధనా - ఆరాధనా....\nఆత్మదేవుడా... నీకే ఆరాధనా.. \nఅద్వితీయుడా - నీకె ఆరాధనా.. ఆరాధనా..\n\n(1) నిండు మనసుతో చేసెద మెండుగ నీ ఆరాధనా.. \nనలిగిన హృదయముతో - పాడెద నీ స్తుతి కీర్తనా..\nవలచినా బ్రతుకునూ - మలచినా యేసయ్యా \nనీకే నీకే చెల్లింతు ఆరాధనా....||ఆరాధన||\n\n(2)  జీవమిచ్చుదేవ నీకు ఉజ్జీవ ఆరాధనా.. \nజీవిత కాలము నీకే అర్పింతును స్తుతి నివేదనా.ఆ.ఆ. \nచెదరినా మనసును సరిచేసినా యేసయ్యా\nనీకే నీకే చెల్లింతు ఆరాధనా॥ ఆరాధనా||";
String song2 =
    "పల్లవి : ఆకాశమా ఆలకించుమా.... \nఓ భూమి నీచెవి యొగ్గుమా...\nనేను పిల్లలను పెంచి గొప్ప వారినిగా చేసితి\nవారు నాపైనే తిరుగుబాటుచేసితిరే ||ఆకాశమా||\n\n(1) యెద్దుకు తెలుసు యజమానుడు \nగాడిద యెరుగును తన దొడ్డిని\nనా ప్రజలకు తెలివేలేదాయెనే \nనను విడిచి సృష్టిని పూజింతురే ||ఆకాశమా||\n\n(2)  పశుప్రాయులై మృగవాంఛతో \nకామాంధులై చెడిపోయిరే \nజీవజలముల ఊటను నను విడచి \nఎండమావికై ఎడారి పాలైరే ||ఆకాశమా||";
String song3 =
    "పల్లవి : చూచే కనులీయుమా నా యేసయ్యా\nచూచే కనులీయుమా \nసర్వాంగ సుందర నీ రూపము\n కనులారా గాంచి తరియింపగా నిన్ను ౹౹చూచే౹౹\n\n(1)  చల్లని వేళా ఏదేను తోటలో \nఆదాము చూచిన నీ రూపము\nవలచినా బ్రతుకునూ - మలచినా యేసయ్యా \nసింధూర వనములో అబ్రహామును దర్శించినా  \nదేవ నీ రూపము కనులార గాంచి \nతరియింపగా నిన్ను ౹౹చూచే౹౹\n\n(2)  అల యాకోబుతో పెనుగులాడి \nదీవించినా దేవ నీ రూపము \nమండు పొదలో మోషేను పిలిచినా\nనాదేవ దేవా నీ రూపము \nకనులార గాంచి తరియింపగ నన్ను ౹౹చూచే౹౹";
String song4 =
    "పల్లవి : నా ప్రియుడు నజరేయుడు\nనా దేవుడు ఉన్నవాడు \nఆనందభరితుడనై - అతని నీడలో \nనిత్యము నిలచి యుందును ||నా ప్రియుడు||\n\n(1) ద్రాక్షారసములకన్నా మధురము ఆ ప్రేమా... \nదాచునన్ను కౌగిలిలో - నా యేసు ప్రేమా..\nపరిమళాల కన్నా పరవశమైనా... \nప్రేమయైయున్నాడు నా దేవుడు ||నా ప్రియుడు||\n\n(2)  జలరాశుల గలగలలు పోలిన ఆ స్వరము \nహిమమంత ధవళమును కలిగిన ఆ శిరము \nఅగ్నివంటి నేత్రాలు - అపరంజి పాదాలు\nకలిగివున్నవాడు - నా ఇమ్మానుయేలు ||నా ప్రియుడు ||";
String song5 =
    "పల్లవి : గోల్గతా కొండపైనా నీ కొరకూ నా కొరకూ\nకన్నీరు కార్చింది ప్రేమా కడగళ్ళ నోర్చింది ప్రేమా \n॥గొల్గోతా౹౹\n\n(1) గెత్సమనే తోటలో దుఖ:పడినదీ \nకడువేదనతో చెమటే రక్తమైనదీ \nకన్నీళ్ళతో తండ్రిని వేడుకొన్నది\nప్రాణాలను బలిచేయ సిద్ధపడినది \nవధకు తేబడిన గొర్రెవోలే - తన శిరము వంచుకున్నది\nనీ కొరకూ, నా కొరకూ మన కొరకూ మనందరి కొరకూ \n॥గొల్గోతా౹౹\n\n(2)  అపరాధిగ తాను ఎంచబడినది అన్యాయపు  \nతీర్పును పొందియున్నది \nఅరచేతుల దెబ్బలు తాను తిన్నది\nతన దేహం సాళ్ళవలె దున్నబడినది\nమనుషులెవరు చూడనొల్లనీ రూపముగా మార్చబడినది\nనీ కొరకూ, నా కొరకూ మన కొరకూ మనందరి కొరకూ \n॥గొల్గోతా౹౹";
String song6 =
    "పల్లవి : నా బలమా నిన్నే కీర్తింతునూ\nనా శైలమా నిన్నే స్తుతియింతునూ \nస్తుతియించి స్తుతియించి స్తోత్రింతును\nపొగడి పొగడి పాడెదనూ\n\n(1) పరాక్రమము ప్రభావము - పరిశుద్ధుడవు నీవే  \nవేకువనే లేచి వెదకెదనూ ఉత్సాహ గానము చేసెదను\n||స్తుతియించి|| ||నా బలమా॥\n\n(2)  దివి యందూ భువి యందు \nఆకాశ మందు అధికారి నీవే \nస్తుతి మహిమలు నీకే ఆరోపింతును\nస్తుతిగానములే చేసెదనూ...\n||స్తుతియించి|| ||నా బలమా ||";

List songs = [
  Song("ఆరాధనా", song1, "అద్వితీయుడు"),
  Song("ఆకాశమా", song2, "అద్వితీయుడు"),
  Song("చూచే కన్నులీయుమా", song3, "అద్వితీయుడు"),
  Song("నా ప్రియుడు", song4, "అద్వితీయుడు"),
  Song("గోల్గతా", song5, "అద్వితీయుడు"),
  Song(" నా బలమా ", song6, "అద్వితీయుడు"),
];
